tap "homebrew/bundle"
tap "sheatsley/formulae"
# Arduino command-line interface
brew "arduino-cli"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Command-line tool to solve Leetcode problems
brew "leetup"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Yet Another Dotfiles Manager
brew "yadm"
# Zstandard is a real-time compression algorithm
brew "zstd"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "font-dejavu-sans-mono-nerd-font"
# The successor to Hyperion aka Hyperion Next Generation
cask "hyperion-ng"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# GameStream client
cask "moonlight"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Mesh VPN based on WireGuard
cask "tailscale"
# Virtual machines UI using QEMU
cask "utm"
# Keyboard configurator
cask "via"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Video communication and virtual meeting platform
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
